Revit 2027 API
ViewPlan.GetUnderlayOrientation Method
 Returns the underlay orientation of this view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public UnderlayOrientation GetUnderlayOrientation()
Public Function GetUnderlayOrientation As UnderlayOrientation
public:
UnderlayOrientation GetUnderlayOrientation()
member GetUnderlayOrientation : unit -> UnderlayOrientation
Return Value
UnderlayOrientation
 The underlay orientation for this view.
See Also
Reference
ViewPlan Class
Autodesk.Revit.DB Namespace